app/Controllers/Admin/Charts.php

SELECT *
FROM `event`
---
    public function index()
    {
        $eventModel = new EventModel();

        $events = $eventModel->findAll();