app/Models/EventModel.php

SELECT `id`, `title`
FROM `event`
WHERE `title` LIKE '%event%' ESCAPE '!'
---
    public function search($term)
    {
        if ($term === null) {
            return [];
        }

        return $this->select('id, title')
            ->like('title', $term)
            ->get()
            ->getResultArray();